temp1/src/Enums/АвтоматизацияВидыСобытий/АвтоматизацияВидыСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АвтоматизацияВидыСобытий</name>
  <enumValues>
    <name>ПередЗаписьюИсточника</name>
  </enumValues>
  <enumValues>
    <name>ПовторяющеесяСобытие</name>
  </enumValues>
  <enumValues>
    <name>ПриЗаписиИсточника</name>
  </enumValues>
</mdclass:Enum>

temp1/src/Catalogs/АвтоматизацияСценарии/АвтоматизацияСценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АвтоматизацияСценарии</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.АвтоматизацияВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРасписания</name>
    <type>
      <types>EnumRef.АвтоматизацияПериодичностиСценариев</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Команды</name>
    <attributes>
      <name>Выполнять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>CatalogRef.АвтоматизацияУсловия</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.АвтоматизацияКоманды</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/CommonModules/АвтоматизацияПовтИсп/Module.bsl
Функция ЗаполнитьСписокВыбораТипаИсточника() Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	// Справочники
	Для Каждого Справочник Из Метаданные.Справочники Цикл
		СписокВыбора.Добавить("Справочник." + Справочник.Имя, Справочник.Синоним, , БиблиотекаКартинок.Справочник);
	КонецЦикла;
	
	// Документы
	Для Каждого Документ Из Метаданные.Документы Цикл
		СписокВыбора.Добавить("Документ." + Документ.Имя, Документ.Синоним, , БиблиотекаКартинок.Документ);
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

Функция ПолучитьТипыСКонтактнойИнформацией() Экспорт
	
	МассивТипов = Новый Массив;
	
	Для Каждого Справочник Из Метаданные.Справочники Цикл
		Если Справочник.ТабличныеЧасти.Найти("КонтактнаяИнформация") <> Неопределено Тогда
			МассивТипов.Добавить(Тип("СправочникСсылка."+Справочник.Имя));
		КонецЕсли;
	КонецЦикла;
	Для Каждого Документ Из Метаданные.Документы Цикл
		Если Документ.ТабличныеЧасти.Найти("КонтактнаяИнформация") <> Неопределено Тогда
			МассивТипов.Добавить(Тип("ДокументСсылка."+Документ.Имя));
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивТипов;
	
КонецФункции

// Функция - проверяет по имени объекта, есть он в существсующих сценариях или нет.
//
// Возвращаемое значение:
//  Булево.
//
Функция ОбъектИспользуетсяВСценариях(Знач ИмяОбъекта) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АвтоматизацияСценарии.ТипИсточника КАК ТипИсточника
		|ИЗ
		|	Справочник.АвтоматизацияСценарии КАК АвтоматизацияСценарии
		|ГДЕ
		|	НЕ АвтоматизацияСценарии.ПометкаУдаления
		|	И АвтоматизацияСценарии.Актуален
		|	И АвтоматизацияСценарии.ВидСобытия В (ЗНАЧЕНИЕ(Перечисление.АвтоматизацияВидыСобытий.ПриЗаписиИсточника), ЗНАЧЕНИЕ(Перечисление.АвтоматизацияВидыСобытий.ПередЗаписьюИсточника))
		|	И НЕ АвтоматизацияСценарии.ЭтоГруппа
		|	И АвтоматизацияСценарии.ТипИсточника = &ТипИсточника";
	Запрос.УстановитьПараметр("ТипИсточника", ИмяОбъекта);	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции
